/* 
ให้ตอบคำถามต่อไปนี้ พร้อมยกตัวอย่างประกอบ
1. let vs const ต่างกันยังไง
- let เป็น variable ที่สามารถ reassign ได้ 
เช่น let name = "Mary";
กลับกัน const เป็น variable ที่ไม่สามารถ reassign ได้
Const Mathscore = [95, 60, 45, 89];

2. Type Conversion มี 2 แบบคือ Implicit Type Conversion กับ Explicit Type Conversion ทั้งสองแบบต่างกันอย่างไร
-   Implicit Type Conversion คือข้อมูลที่ javascript แอบเปลี่ยนประเภทข้อมูลให้
        ตัวอย่าง: let result = 10 + "5"; // ผลลัพธ์คือ "105" ที่เป็น string
    Explicit Type Conversion คือข้อมูลที่เรากำหนด type เอง
        ตัวอย่าง: let result = 10 + Number("5"); // ผลลัพธ์คือ 15 ที่เป็น number

3. เวลาเจอโจทย์จะรู้ได้ยังไงว่าควรประกาศตัวแปรเป็น Array หรือ Object 
- ถ้า array จะเป็นชุดข้อมูลเดียวกัน เช่น คะแนนสอบของนักเรียนห้อง1 
    object จะเป็นชุดข้อมูลที่เป็น key: value เช่น
    name: Jip
    age: 26
    แต่อาจจะมีเป็นหลายชุดข้อมูลแตกต่างกันไป

4. function คืออะไร สำคัญยังไง
- คือ block code ที่เราสั่งให้ทำอะไรสักอย่าง และนำกลับมาใช้ได้เรื่อยๆ เช่น ฟังก์ชั่นในการคำนวนคะแนนสอบเฉลี่ยของเด็กแต่ละห้อง

5. เมื่อไรควรใช้ loop สังเกตยังไง
- เมื่อต้องการเข้าถึงข้อมูล array ทุกตัว เช่น ต้องการเข้าถึงคะแนนของนักเรียนห้องหนึ่งเพื่อนำมาหาค่าเฉลี่ย/หาคะแนนต่ำสุด-สูงสุด แล้วแต่เราอยากเอามาใช้

6. โจทย์ระบุว่ามีคะแนนสอบอยู่ 1 ชุด เก็บอยู่ในรูปแบบนี้ [10, 8, 7, ...] ต้องการหาว่ามีคนสอบตกกี่คน คำถามคือ ข้อนี้ใช้ Operation อะไรบ้าง สังเกตยังไง   
-   การกำหนดค่า: ต้องมีการสร้าง var เปล่าเอาไว้นับจำนวนคนที่สอบตก
    loop: เข้าไปตรวจสอบสมาชิกทุกตัวใน array
    if-else: ต้องมีการสร้างเงื่อนไขว่าคะแนนเท่าไหร่ถึงจะเป็นการสอบผ่าน-ตก
    การเปรียบเทียบ: เพราะเทียบคะแนนที่ผ่านเกณฑ์
    การแสดงผล: ต้องแสดงผลออกมาว่ามีคนตกกี่คน
*/